Revit 2027 API
BuiltInFailures.RevolutionFailures.ProfileCrossesRevolutionAxis Property
 The profile must not cross the axis of revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProfileCrossesRevolutionAxis { get; }
Public Shared ReadOnly Property ProfileCrossesRevolutionAxis As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProfileCrossesRevolutionAxis {
	FailureDefinitionId^ get ();
}
static member ProfileCrossesRevolutionAxis : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevolutionFailures Class
Autodesk.Revit.DB Namespace